Revit 2026 API

# GridCurve Property

---

Retrieves an object that represents the geometry of the grid line.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve Curve { get; }
```
```vb
Public ReadOnly Property Curve As Curve
	Get
```
```cpp
public:
property Curve^ Curve {
	Curve^ get ();
}
```
```fsharp
member Curve : Curve with get
```

#### Property Value

Curve

The geometry can either be an arc or a curve. The IsCurved property can be used to determine this.

#### Reference

Grid Class

Autodesk.Revit.DB Namespace